/***************************************************************
 * copyright (c) 2009, gaocheng
 * all rights reserved.
 *
 * file name   : semaphore.h
 * version     : 1.0
 * description :
 * author      : gaocheng
 * date        : 2009-04-22
 ***************************************************************/

#ifndef __SIGNAL_H__
#define __SIGNAL_H__

/***************************************************************
 include header file
 ***************************************************************/

#pragma pack(4)

/***************************************************************
 macro define
 ***************************************************************/
//#define SEM_DEBUG

/* 信号量数量 */
#define SEMB_NUM 0x100

/***************************************************************
 enum define
 ***************************************************************/

/***************************************************************
 struct define
 ***************************************************************/
/***************************************************************
 * description :
 ***************************************************************/
struct sem_cfg {
    os_u32 size;
    os_u32 count;
};

/***************************************************************
 * description :
 ***************************************************************/
struct semcb_queue_struct {
    /* 阻塞任务task */
    HTASK handle;
    os_u32 who;
    struct semcb_queue_struct *next;
};

/***************************************************************
 * description : binary and count semphore
 ***************************************************************/
struct count_semphore {
    spinlock_t lock; /* lock of count */
    os_s32 count;
};

/***************************************************************
 * description :
 ***************************************************************/
struct sem_struct {
    /* 回指内存控制块 */
    struct semcb_struct *semcb;
    /* sem name */
    os_u8 *name;
    /* 分配代码行号 */
    os_u32 line;
    /* which task get this lock */
    HTASK holder;
#define SEMB_CRC UINT32_C(0x5a)
    /* 校验位 */
    os_u32 crc;
    /* 有符号数信号量 */
    struct count_semphore sem;
    /* 阻塞队列中任务, 防止中断中出现死循环 */
    os_uint num;
    struct semcb_queue_struct *head;
};

/***************************************************************
 * description :
 ***************************************************************/
struct semcb_struct {
    struct sem_struct *addr;
    struct semcb_struct *next;
};

/***************************************************************
 * description :
 ***************************************************************/
struct semcb_info_struct {
    os_u32 idle_num;
    struct semcb_struct *idle_block;
};

/***************************************************************
 extern function
 ***************************************************************/

#pragma pack()

#endif /* end of header */

