/***************************************************************
 * copyright (c) 2009, gaocheng
 * all rights reserved.
 *
 * file name   : pci.c
 * version     : 1.0
 * description : (key) not hot-plug
 * author      : gaocheng
 * date        : 2009-04-22
 ***************************************************************/

/***************************************************************
 include header file
 ***************************************************************/
#include <core.h>
#include <vbs.h>

/***************************************************************
 global variable declare
 ***************************************************************/

#define MAX_PCI_BUS_NUM 0x100
#define MAX_PCI_DEVICE_NUM 32
#define MAX_PCI_FUNC_NUM 8

#define MAX_PCI_INT_NUM 0x4

/* Under PCI, each device has 256 bytes of configuration address space,
   of which the first 64 bytes are standardized as follows: */
#define PCI_VENDOR_ID 0x00 /* 16 bits */
#define PCI_DEVICE_ID 0x02 /* 16 bits */
#define PCI_COMMAND 0x04 /* 16 bits */
#define PCI_COMMAND_IO 0x1 /* Enable response in I/O space */
#define PCI_COMMAND_MEMORY 0x2 /* Enable response in Memory space */
#define PCI_COMMAND_MASTER 0x4 /* Enable bus mastering */
#define PCI_COMMAND_SPECIAL 0x8 /* Enable response to special cycles */
#define PCI_COMMAND_INVALIDATE 0x10 /* Use memory write and invalidate */
#define PCI_COMMAND_VGA_PALETTE 0x20 /* Enable palette snooping */

#define PCI_PM_CTRL_STATE_MASK 0x0003 /* Current power state (D0 to D3) */
#define PCI_PM_CTRL_PME_ENABLE 0x0100 /* PME pin enable */
#define PCI_PM_CTRL_DATA_SEL_MASK 0x1e00 /* Data select (??) */
#define PCI_PM_CTRL_DATA_SCALE_MASK 0x6000 /* Data scale (??) */
#define PCI_PM_CTRL_PME_STATUS 0x8000 /* PME pin status */
#define PCI_PM_PPB_EXTENSIONS 6 /* PPB support extensions (??) */
#define PCI_PM_PPB_B2_B3 0x40 /* Stop clock when in D3hot (??) */
#define PCI_PM_BPCC_ENABLE 0x80 /* Bus power/clock control enable (??) */
#define PCI_PM_DATA_REGISTER 7 /* (??) */
#define PCI_PM_SIZEOF 8

/* AGP registers */
#define PCI_AGP_VERSION 2 /* BCD version number */
#define PCI_AGP_RFU 3 /* Rest of capability flags */
#define PCI_AGP_STATUS 4 /* Status register */
#define PCI_AGP_STATUS_RQ_MASK 0xff000000 /* Maximum number of requests - 1 */
#define PCI_AGP_STATUS_SBA 0x0200 /* Sideband addressing supported */
#define PCI_AGP_STATUS_64BIT 0x0020 /* 64-bit addressing supported */
#define PCI_AGP_STATUS_FW 0x0010 /* FW transfers supported */
#define PCI_AGP_STATUS_RATE4 0x0004 /* 4x transfer rate supported */
#define PCI_AGP_STATUS_RATE2 0x0002 /* 2x transfer rate supported */
#define PCI_AGP_STATUS_RATE1 0x0001 /* 1x transfer rate supported */
#define PCI_AGP_COMMAND 8 /* Control register */
#define PCI_AGP_COMMAND_RQ_MASK 0xff000000 /* Master: Maximum number of requests */
#define PCI_AGP_COMMAND_SBA 0x0200 /* Sideband addressing enabled */
#define PCI_AGP_COMMAND_AGP 0x0100 /* Allow processing of AGP transactions */
#define PCI_AGP_COMMAND_64BIT 0x0020 /* Allow processing of 64-bit addresses */
#define PCI_AGP_COMMAND_FW 0x0010 /* Force FW transfers */
#define PCI_AGP_COMMAND_RATE4 0x0004 /* Use 4x rate */
#define PCI_AGP_COMMAND_RATE2 0x0002 /* Use 4x rate */
#define PCI_AGP_COMMAND_RATE1 0x0001 /* Use 4x rate */
#define PCI_AGP_SIZEOF 12

/* Slot Identification */
#define PCI_SID_ESR 2 /* Expansion Slot Register */
#define PCI_SID_ESR_NSLOTS 0x1f /* Number of expansion slots available */
#define PCI_SID_ESR_FIC 0x20 /* First In Chassis Flag */
#define PCI_SID_CHASSIS_NR 3 /* Chassis Number */

/* Message Signalled Interrupts registers */
#define PCI_MSI_FLAGS 2 /* Various flags */
#define PCI_MSI_FLAGS_64BIT 0x80 /* 64-bit addresses allowed */
#define PCI_MSI_FLAGS_QSIZE 0x70 /* Message queue size configured */
#define PCI_MSI_FLAGS_QMASK 0x0e /* Maximum queue size available */
#define PCI_MSI_FLAGS_ENABLE 0x01 /* MSI feature enabled */
#define PCI_MSI_RFU 3 /* Rest of capability flags */
#define PCI_MSI_ADDRESS_LO 4 /* Lower 32 bits */
#define PCI_MSI_ADDRESS_HI 8 /* Upper 32 bits (if PCI_MSI_FLAGS_64BIT set) */
#define PCI_MSI_DATA_32 8 /* 16 bits of data for 32-bit devices */
#define PCI_MSI_DATA_64 12 /* 16 bits of data for 64-bit devices */

/***************************************************************
 * description : 设备类型配置空间
 ***************************************************************/
struct pci_config_space_device {
    os_u32 base_addr_reg[6]; /* 10h */
    os_u32 reserve1[2]; /* 28h */
    os_u32 extend_rom; /* 30h */
    os_u32 reserve2[2]; /* 34h */
    os_u8 int_line, int_pin, min_gnt, max_lat; /* 3ch */
};

/***************************************************************
 * description : 桥类型配置空间
 ***************************************************************/
struct pci_config_space_bridge {
    os_u32 base_addr_reg[2]; /* 10h */
    os_u8 primary_bus_num, secondary_bus_num, subordinate_bus_num, secondary_latency_timer; /* 18h */
    os_u8 io_base, io_limit; /* 1ch */
    os_u16 secondary_status; /* 1ch */
    os_u16 memory_base, memory_limit; /* 20h */
    os_u16 prefetchable_memory_base, prefetchable_memory_limit; /* 24h */
    os_u32 prefetchable_base_upper_32bits; /* 28h */
    os_u32 prefetchable_limit_upper_32bits; /* 2ch */
    os_u16 io_base_upper_16bits, io_limit_upper_16bits; /* 30h */
    os_u32 reserved_capabilities_pointer; /* 34h */
    os_u32 expansion_rom_base_addr; /* 38h */
    os_u8 int_line, int_pin; /* 3ch */
    os_u16 bridge_control; /* 3ch */
};

/***************************************************************
 * description :
 ***************************************************************/
struct pci_config_space {
    os_u16 vendor_id, device_id; /* 00h */
    os_u16 command, status; /* 04h */
    os_u32 classcode_revisionid; /* 08h */
    os_u8 cacheline_size, latency_timer, head_type, bist; /* 0ch */
    union {
        struct pci_config_space_device device;
        struct pci_config_space_bridge bridge;
    } u;
};

#define PCI_CHECK 0xbcaebcae

/***************************************************************
 * description :
 ***************************************************************/
struct pci_dev {
    struct list_node list;
    os_u32 bus, device, func;
    struct pci_config_space config_info; /* pci设备配置空间信息 */
    os_u32 check;
    os_void *dedicated;
    const struct pci_driver *driver;
};

/***************************************************************
 * description :
 ***************************************************************/
struct pci_bridge {
    struct list_node list;
    struct pci_config_space config_info; /* pci桥设备配置空间 */
};

/***************************************************************
 * description :
